import React, {Component} from 'react';
import {observer} from "mobx-react";
import Layout from "../../libs/components/UI/Layout";
import {Menu} from 'antd';
import {
  PieChartOutlined,
  RollbackOutlined,
  DollarOutlined,
  FundViewOutlined,
  IdcardOutlined,
  TeamOutlined
} from '@ant-design/icons';
import Head from "next/head";

const {SubMenu} = Menu;


@observer
class Index extends Component {
  state = {
    menuList: [
      {title: "عمومی", id: "general", icon: <FundViewOutlined/>},
      {title: "راهنمای ترجمه", id: "translate", icon: <IdcardOutlined/>},
      {title: "راهنمای مشتریان", id: "user", icon: <TeamOutlined/>},
    ],
    key: ''
  }
  handleClick = ({key}) => {
    console.log(key)
    let menuList = this.state.menuList
    switch (key) {
      case "general":
        menuList = [
          {title: "برگشت", id: "back", icon: <RollbackOutlined/>},
          {title: "نحوه افزایش اعتبار", id: "credit", icon: <FundViewOutlined/>},
          {title: "مشاهده گزارش تراکنشها ", id: "transaction", icon: <IdcardOutlined/>},
          {title: "نحوه افزایش اعتبار", id: "how", icon: <DollarOutlined/>}
        ]
        break;
      case "translate":
        menuList = [
          {title: "برگشت", id: "back", icon: <RollbackOutlined/>},
          {title: "نحوه ثبت نام به عنوان مترجم", id: "credit", icon: <FundViewOutlined/>},
          {title: "نحوه ایجاد یک پروفایل کامل", id: "profile", icon: <IdcardOutlined/>},
          {title: "ایجاد پیشنهاد بر روی پروژه", id: "offer", icon: <IdcardOutlined/>},
          {title: "میزان درآمد و کمیسیون یک پروژه", id: "income", icon: <DollarOutlined/>},
        ]
        break;
      case "user":
        menuList = [
          {title: "برگشت", id: "back", icon: <RollbackOutlined/>},
          {title: "نحوه ایجاد پروژه", id: "create", icon: <FundViewOutlined/>},
          {title: "واژگان تخصصی", id: "words", icon: <IdcardOutlined/>},
          {title: "نحوه انتخاب یک مترجم", id: "select", icon: <IdcardOutlined/>},
          {title: "نحوه پرداخت مبلغ پروژه ", id: "pay", icon: <DollarOutlined/>},
        ]
        break;
      case "back":
        menuList = [
          {title: "عمومی", id: "general", icon: <IdcardOutlined/>},
          {title: "راهنمای ترجمه", id: "translate", icon: <FundViewOutlined/>},
          {title: "راهنمای مشتریان", id: "user", icon: <PieChartOutlined/>},
        ]
        break;
      // default :
      //   menuList = [
      //     {title: "عمومی", id: "general", icon: <PieChartOutlined/>},
      //     {title: "راهنمای ترجمه", id: "translate", icon: <PieChartOutlined/>},
      //     {title: "راهنمای مشتریان", id: "user", icon: <PieChartOutlined/>},
      //   ]
    }

    this.setState({menuList, key})
  }


  _renderHelp = () => {
    return (<div className="user-panel radius mt-3 mb-4">
      <h1 className="h5">راهنما</h1>
      <hr/>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
        طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
        توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
        نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
        استفاده قرار گیرد.</p>
      <div className="border shadow-sm raduis m-5 p-2">
        <img src={"/static/images/help/help.png"} className={"img-fluid"}/>
      </div>
      <div className="my-3">
        <h2 className="h6">عمومی</h2>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
          چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
          مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
          درصد
          گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
          برای
          طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
          توان امید داشت.</p>
      </div>
      <div className="my-3">
        <h2 className="h6">راهنمای ترجمه</h2>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
          چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
          مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
          درصد
          گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
          برای
          طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
          توان امید داشت.</p>
      </div>
      <div className="my-3">
        <h2 className="h6">راهنمای مشتریان</h2>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
          چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
          مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
          درصد
          گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
          برای
          طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
          توان امید داشت.</p>
      </div>
    </div>)
  }

  _renderGeneral = () => {
    return (<div className="user-panel radius mt-3 mb-4">
      <h1 className="h5"> راهنمای عمومی </h1>
      <hr/>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
        طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
        توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
        نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
        استفاده قرار گیرد.</p>
      <div className="border shadow-sm raduis m-5 p-2">
        <img src={"/static/images/help/panel.png"} className={"img-fluid"}/>
      </div>
      <div className="my-3">
        <h2 className="h6">پنل کاربر</h2>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
          چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
          مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
          درصد
          گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
          برای
          طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
          توان امید داشت.</p>
      </div>
      <div className="my-3">
        <h2 className="h6">پنل مترجم</h2>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
          چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
          مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
          درصد
          گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
          برای
          طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
          توان امید داشت.</p>
      </div>
      <div className="my-3">
        <h2 className="h6">پنل مترجم</h2>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
          چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
          مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
          درصد
          گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
          برای
          طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
          توان امید داشت.</p>
      </div>
    </div>)
  }

  _renderTranslate = () => {
    return (<div className="user-panel radius mt-3 mb-4">
      <h1 className="h5"> راهنمای ترجمه </h1>
      <hr/>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
        طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
        توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
        نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
        استفاده قرار گیرد.</p>
      <div className="border shadow-sm raduis m-5 p-2">
        <img src={"/static/images/help/order.png"} className={"img-fluid"}/>
      </div>

    </div>)
  }

  _renderCustomer = () => {
    return (<div className="user-panel radius mt-3 mb-4">
      <h1 className="h5"> راهنمای مشتریان </h1>
      <hr/>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
        طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
        توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
        نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
        استفاده قرار گیرد.</p>
      <div className="border shadow-sm raduis m-5 p-2">
        <img src={"/static/images/help/lng.png"} className={"img-fluid"}/>
      </div>

    </div>)
  }

  _renderCredit = () => {
    return (<div className="user-panel radius mt-3 mb-4">
      <h1 className="h5">نحوه افزایش اعتبار</h1>
      <hr/>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
        طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
        توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
        نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
        استفاده قرار گیرد.</p>
      <div className="border shadow-sm raduis m-5 p-2">
        <img src={"/static/images/help/list.png"} className={"img-fluid"}/>
      </div>

    </div>)
  }

  _renderTransaction = () => {
    return (<div className="user-panel radius mt-3 mb-4">
      <h1 className="h5">مشاهده گزارش تراکنشها </h1>
      <hr/>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
        طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
        توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
        نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
        استفاده قرار گیرد.</p>
      <div className="border shadow-sm raduis m-5 p-2">
        <img src={"/static/images/help/income.png"} className={"img-fluid"}/>
      </div>

    </div>)
  }

  _renderHow = () => {
    return (<div className="user-panel radius mt-3 mb-4">
      <h1 className="h5">نحوه افزایش اعتبار</h1>
      <hr/>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
        طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
        توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
        نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
        استفاده قرار گیرد.</p>
      <div className="border shadow-sm raduis m-5 p-2">
        <img src={"/static/images/help/wallet.png"} className={"img-fluid"}/>
      </div>

    </div>)
  }

  _renderShow = () => {

    switch (this.state.key) {
      case "general":
        return this._renderGeneral()
      case "translate":
        return this._renderTranslate()
      case "user":
        return this._renderCustomer()
      case "credit":
        return this._renderCredit()
      case "transaction":
        return this._renderTransaction()
      case "how":
        return this._renderHow()
      default:
        return this._renderHelp()
    }
  }


  render() {


    return (
      <>
        <Head><title>راهنما</title></Head>
        <Layout>
          <section>
            <div className="container">
              <div className="row ">
                <div className="col-3">
                  <div className="user-sidebar radius my-3">

                    <Menu
                      onClick={this.handleClick}
                      defaultSelectedKeys={['1']}
                      defaultOpenKeys={['sub1']}
                      mode="inline"
                    >
                      {this.state.menuList.map(item => (
                        <Menu.Item className={item.id === 'back' ? "border-bottom" : ''} key={item.id} icon={item.icon}>{item.title}</Menu.Item>))}
                    </Menu>
                  </div>
                </div>
                <div className="col-9 pr-0">
                  {this._renderShow()}
                </div>
              </div>
            </div>
          </section>
        </Layout>
      </>
    );
  }
}

export default Index;